Revit 2026 API

# ColumnAttachmentGetColumnAttachment(FamilyInstance, Int32) Method

---

Look up a column attachment. There is at most one attachment on the base and one on the top.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ColumnAttachment GetColumnAttachment(
	FamilyInstance column,
	int baseOrTop
)
```
```vb
Public Shared Function GetColumnAttachment (
	column As FamilyInstance,
	baseOrTop As Integer
) As ColumnAttachment
```
```cpp
public:
static ColumnAttachment^ GetColumnAttachment(
	FamilyInstance^ column,
	int baseOrTop
)
```
```fsharp
static member GetColumnAttachment :
        column : FamilyInstance *
        baseOrTop : int -> ColumnAttachment
```

#### Parameters

column FamilyInstance
     A column.
baseOrTop Int32
     0 for base, 1 for top.

#### Return Value

ColumnAttachment The column attachment for the base or top of the column, or  if that end of the column is unattached.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| ArgumentOutOfRangeException | baseOrTop must be either 0 or 1. |

#### Reference

ColumnAttachment Class

GetColumnAttachment Overload

Autodesk.Revit.DB Namespace